# ProcessIFCProject Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ImporterIFC..::..ProcessIFCProject Method
ImporterIFC Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ProcessIFCProject(IFCAnyHandle) | The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements. |
| ProcessIFCProject(IFCAnyHandle, IDictionary<(Of <<'(IFCAnyHandle, ElementId>)>>)) |

# See Also
ImporterIFC Class
ImporterIFC Members
Autodesk.Revit.DB.IFC Namespace